app/controllers/shift_details_controller.rb

  def index
    @shift_details = ShiftDetail.where(user: current_user)
---
SELECT "shift_details".* FROM "shift_details" WHERE "shift_details"."user_id" = 5

  def create
    @shift_detail = ShiftDetail.new(shift_detail_params)
    @shift_detail.user_id = current_user.id
    respond_to do |format|
      if @shift_detail.save
---
INSERT INTO "shift_details" ("shift_name", "description", "user_id", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    shift_detail_params[:user_id] = current_user.id
    respond_to do |format|
      if @shift_detail.update(shift_detail_params)
---
UPDATE "shift_details" SET "description" = $1, "updated_at" = $2 WHERE "shift_details"."id" = $3  [["description", "checking"], ["updated_at", "2015-10-11 04:21:27.719700"], ["id", 3]]

  def destroy
    @shift_detail.destroy
---
DELETE FROM "shift_details" WHERE "shift_details"."id" = $1  [["id", 5]]

    def set_shift_detail
      @shift_detail = ShiftDetail.find(params[:id])
---
SELECT  "shift_details".* FROM "shift_details" WHERE "shift_details"."id" = $1 LIMIT 1  [["id", 5]]