app/controllers/users_controller.rb

  def index
    #@users = User.all
    @search = User.search do
---
SELECT "users".* FROM "users"

  def edit
    @shift_details = @user.shift_details.where.not(start_time: nil)
    @shift_detail = @user.shift_details.create
---
SELECT "shift_details".* FROM "shift_details" WHERE "shift_details"."user_id" = $1 AND ("shift_details"."start_time" IS NOT NULL)  [["user_id", 3]]
INSERT INTO "shift_details" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2015-10-12 10:26:30.388352"], ["updated_at", "2015-10-12 10:26:30.388352"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "mobile" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["mobile", "976558835"], ["encrypted_password", "$2a$10$9aOPPJNvm2rDQMTsRHdnwurUYHmuuTzT.F7EuhpQ.cUTOPuFKP2me"], ["updated_at", "2015-10-13 09:10:12.239296"], ["id", 3]]